DataProcessors/упРМТорговогоПредставителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМТорговогоПредставителя</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>дрвРаботыПоТекущемуРейсу</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнеры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРейсов</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданияПоРейсам</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/упПартнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПартнеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресВозвратаДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеРесурсы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетПечатныхФормЗадание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШаблоныПакетовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетПечатныхФормРейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШаблоныПакетовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетРегламентныхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПакетыРегламентныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<Comment>Прочие отношения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РейтингПеревозчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервиснаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладАЗС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображенияМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиЛиний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страховщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОформлениеПутевогоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСоглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеТипыТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеПредставители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговыйПредставитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/упРМТорговогоПредставителя/Forms/РабочееМесто/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	КонецЕсли; 
	
	Объект.Партнеры.ЗагрузитьЗначения(СписокДоступныхПартнеров(ПользователиКлиентСервер.ТекущийПользователь()));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Реализовано не на динамическом списке, потому что у пользователя работающего с РМ
	// урезан набор ролей, списки заполняются в привилегированном режиме.
	ПодключитьОбработчикОжидания("ОбновитьСписокРейсовНаКлиенте",0.1,Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокРейсовПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбработатьВыборСтрокиСпискаРейсов", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьСписокРейсовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура дрвРаботыПоТекущемуРейсуПриАктивизацииСтроки(Элемент)
	Если Элементы.дрвРаботыПоТекущемуРейсу.ТекущиеДанные <> Неопределено Тогда
		Элементы.дрвРаботыПоТекущемуРейсуТоварныйСостав.Доступность = Ложь
		                                                              Или Элементы.дрвРаботыПоТекущемуРейсу.ТекущиеДанные.ЭтоРабота
														  Или ЗначениеЗаполнено(Элементы.дрвРаботыПоТекущемуРейсу.ТекущиеДанные.ПрохождениеТочки);
	Иначе
		Элементы.дрвРаботыПоТекущемуРейсуТоварныйСостав.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПрисоединенныеФайлы(Команда)
	
	ТекущиеДанные = Элементы.дрвРаботыПоТекущемуРейсу.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда

		Если ТекущиеДанные.ЕстьФайлы Тогда
			ВладелецФайла = Неопределено;
			Если ТекущиеДанные.ЭтоАдрес Тогда
				Если ЗначениеЗаполнено(ТекущиеДанные.ПрохождениеТочки) Тогда
					ВладелецФайла = ТекущиеДанные.ПрохождениеТочки;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(ТекущиеДанные.ЗаданиеЗаявкаНаПеревозкуГруза) Тогда
					ВладелецФайла = ТекущиеДанные.ЗаданиеЗаявкаНаПеревозкуГруза;
				КонецЕсли;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ВладелецФайла) Тогда
			
				сткПараметры = Новый Структура;
				сткПараметры.Вставить("ВладелецФайла",  ВладелецФайла);
				сткПараметры.Вставить("ТолькоПросмотр", Истина);
				
				ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлы",сткПараметры, ЭтаФорма, УникальныйИдентификатор,);

				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписокРейсовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
	
	ЭлементыДерева = Объект.дрвРаботыПоТекущемуРейсу.ПолучитьЭлементы();
	Для каждого текТочка Из ЭлементыДерева Цикл
		ЭлементыЗадания = текТочка.ПолучитьЭлементы();
		Для каждого текЗадание Из ЭлементыЗадания Цикл
			ЭлементыОперации = текЗадание.ПолучитьЭлементы();
			Для каждого текОперация Из ЭлементыОперации Цикл
				Элементы.дрвРаботыПоТекущемуРейсу.Свернуть(текОперация.ПолучитьИдентификатор());
			КонецЦикла;
			Элементы.дрвРаботыПоТекущемуРейсу.Свернуть(текЗадание.ПолучитьИдентификатор());
		КонецЦикла;
		Элементы.дрвРаботыПоТекущемуРейсу.Свернуть(текТочка.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
	
	ЭлементыДерева = Объект.дрвРаботыПоТекущемуРейсу.ПолучитьЭлементы();
	Для каждого текТочка Из ЭлементыДерева Цикл
		Элементы.дрвРаботыПоТекущемуРейсу.Развернуть(текТочка.ПолучитьИдентификатор());
		ЭлементыЗадания = текТочка.ПолучитьЭлементы();
		Для каждого текЗадание Из ЭлементыЗадания Цикл
			Элементы.дрвРаботыПоТекущемуРейсу.Развернуть(текЗадание.ПолучитьИдентификатор());
			ЭлементыОперации = текЗадание.ПолучитьЭлементы();
			Для каждого текОперация Из ЭлементыОперации Цикл
				Элементы.дрвРаботыПоТекущемуРейсу.Развернуть(текОперация.ПолучитьИдентификатор());
			КонецЦикла; 
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныйСостав(Команда)
	ТекущиеДанныеРаботы = Элементы.дрвРаботыПоТекущемуРейсу.ТекущиеДанные;
	
	сткПараметрыФормы = Новый Структура();
	сткПараметрыФормы.Вставить("РежимРаботыФормы", 2);
		
	Если ТекущиеДанныеРаботы.ЭтоРабота Тогда
		ГрузовоеМесто = ТекущиеДанныеРаботы.НазначениеСтроки;
		СтрокаТипОперации = ТекущиеДанныеРаботы.ПолучитьРодителя();
		СтрокаЗадание = СтрокаТипОперации.ПолучитьРодителя();
		ЗаданиеНаПеревозкуГруза = СтрокаЗадание.НазначениеСтроки;

		сткПараметрыФормы.Вставить("ГрузовоеМесто", ГрузовоеМесто);
		сткПараметрыФормы.Вставить("ЗаданиеНаПеревозкуГрузаПредставление", ЗаданиеНаПеревозкуГруза);
	Иначе	
		сткПараметрыФормы.Вставить("ТоварныйСоставГрузовогоМеста", ПолучитьТоварныйСостав(ТекущиеДанныеРаботы.ПрохождениеТочки));
	КонецЕсли;
		
	ОткрытьФорму("ОбщаяФорма.упИзменениеТоварногоСостава", сткПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ОбработатьВыборСтрокиСпискаРейсов()
	
	// Если выбрана строка с рейсом
	Если Элементы.СписокРейсов.ТекущиеДанные <> Неопределено Тогда
		ТекущийРейс = Объект.ТекущийРейс;
		
		НовыйТекущийРейс = Элементы.СписокРейсов.ТекущиеДанные.Рейс;
		Если ТекущийРейс <> НовыйТекущийРейс Тогда
			Объект.ТекущийРейс 	= НовыйТекущийРейс;
			ОбновитьДанныеПоРейсу();
		КонецЕсли;
	Иначе
			
		Объект.дрвРаботыПоТекущемуРейсу.ПолучитьЭлементы().Очистить();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоРейсу()
	ОбработатьВыборСтрокиСпискаРейсовСервер();
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборСтрокиСпискаРейсовСервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьДеревоРаботПоРейсу();
	ЗначениеВРеквизитФормы(ОбработкаОбъект.дрвРаботыПоТекущемуРейсу, "Объект.дрвРаботыПоТекущемуРейсу");
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСписокРейсовНаКлиенте()
	ОбновитьСписокРейсовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокРейсовНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьСписокРейсов();
	ЗначениеВРеквизитФормы(ОбработкаОбъект.СписокРейсов, "Объект.СписокРейсов");
	ЗначениеВРеквизитФормы(ОбработкаОбъект.ЗаданияПоРейсам, "Объект.ЗаданияПоРейсам");
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокДоступныхПартнеров(Пользователь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УпПартнеры_ТорговыеПредставителиТ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.упСотрудники КАК упСотрудникиТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упПартнеры.ТорговыеПредставители КАК УпПартнеры_ТорговыеПредставителиТ
	|	ПО УпПартнеры_ТорговыеПредставителиТ.ТорговыйПредставитель = упСотрудникиТ.Ссылка
	|ГДЕ упСотрудникиТ.Пользователь = &Пользователь
	|";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ПолучитьТоварныйСостав(ПрохождениеТочки)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат ОбработкаОбъект.ПолучитьТоварныйСостав(ПрохождениеТочки);
	
КонецФункции


#КонецОбласти
